---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType.ET_RunStart
enum: Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType
source: html/b7b2f972-d2d3-8bde-1055-6e73fa9d8b26.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType.ET_RunStart

A connection to the start (lower end) of a stairs run.